export const STATUS_MAP = {
  0: '待处理',
  1: '已撤销',
  2: '同意',
  3: '拒绝'
}

export const MONEY_STATUS_MAP = {
  0: '仅退款',
  1: '退货退款'
}

export const XING = [
	  '赵','钱','孙','李','周','吴','郑','王','冯','陈','褚','卫','蒋','沈','韩','杨','朱','秦','尤','许','何','吕','施','张','孔',
    '曹','严','华','金','魏','陶','姜','戚','谢','邹','苏','潘','葛','奚','范','彭','郎','鲁','韦','昌','马','苗','凤','花','方','俞','任','袁','柳',
    '鲍','史','唐','费','廉','岑','薛','雷','贺','倪','汤','滕','殷','罗','毕','郝','邬','安','常','乐','于','时','傅','皮','卞','齐','康','伍','余',
    '元','卜','顾','孟','平','黄','程','穆','萧','尹','姚','邵','湛','汪','祁','毛','狄','米','贝','明','臧','计','伏','成','戴','谈','宋','茅','庞',
    '熊','纪','舒','屈','项','祝','董','梁','杜','阮','闵','席', '季','贾','娄','江','童','颜','郭','梅','盛','林','刁','钟','徐','邱','骆','高','夏',
    '蔡','田','樊','胡','凌','霍','虞','万','支','柯','管','卢','莫','经','房','裘','缪','解','应','宗','丁','邓','郁','单','杭','洪','包','诸','左',
    '石','崔','龚','和','嵇','邢','裴','陆','荀','甄','芮','羿','储','靳','汲','邴','段','富','巫','乌','焦','巴','弓','牧','隗','山','谷','车','侯',
    '宫','宁','仇','栾','祖','武','符','刘','景','詹','束','龙','叶','司','咸','赖','卓','蔺','屠','蒙','池','乔','闻','莘','党','翟','谭','晏','柴',
    '瞿','阎','习','古','易','廖','步','都','耿','满','弘','匡','蔚','巩','厍','聂','AA','沙','鞠','关','查','司马','上官','欧阳','夏侯','诸葛',
    '东方','赫连','皇甫','尉迟','公羊','澹台','公冶','宗政','濮阳','淳于','单于','太叔','申屠','公孙','仲孙','轩辕','令狐','钟离','宇文',
    '长孙','慕容','鲜于','闾丘','司徒','司空','亓官', '司寇','仉','颛孙','端木','巫马','公西','漆雕','乐正','壤驷','公良','拓跋','夹谷',
    '段干','百里','东郭','南门','呼延','梁丘','左丘','东门','西门','商','牟','伯','赏','南宫','墨','佟','福'
]

export const GOODS_STATUS_MAP = {
  1: '待退货',
  2: '退货中',
  3: '退货成功',
  4: '退货失败',
}

export const CARD_BACKGROUND = [
  {
    id: 1,
    image: 'http://card-1254165941.cosgz.myqcloud.com/cardImages/other/bgwhite.png',
    title: '默认背景',
  },
  {
    id: 2,
    image: 'http://card-1254165941.cosgz.myqcloud.com/cardImages/card/bg.png',
    title: '中国风',
  },
  {
    id: 3,
    image: 'http://card-1254165941.cosgz.myqcloud.com/cardImages/card/bg2.png',
    title: '蓝色商务',
  },
    // 鼠、牛、虎、兔、蛇、 马、羊、猴、鸡、狗、 猪
  {
    id: 4,
    image: 'http://card-1254165941.cosgz.myqcloud.com/cardBg/%E8%80%81%E9%BC%A0.jpg',
    title: '鼠',
  },
  {
    id: 5,
    image: 'http://card-1254165941.cosgz.myqcloud.com/cardBg/%E7%89%9B.jpg',
    title: '牛',
  },
  {
    id: 6,
    image: 'http://card-1254165941.cosgz.myqcloud.com/cardBg/%E8%80%81%E8%99%8E.jpg',
    title: '虎',
  },
  {
    id: 7,
    image: 'http://card-1254165941.cosgz.myqcloud.com/cardBg/%E5%85%94.jpg',
    title: '兔',
  },
  {
    id: 8,
    image: 'http://card-1254165941.cosgz.myqcloud.com/cardBg/%E9%BE%99.jpg',
    title: '龙',
  },
  {
    id: 9,
    image: 'http://card-1254165941.cosgz.myqcloud.com/cardBg/%E8%9B%87.jpg',
    title: '蛇',
  },
  {
    id: 10,
    image: 'http://card-1254165941.cosgz.myqcloud.com/cardBg/%E9%A9%AC.jpg',
    title: '马',
  },
  {
    id: 11,
    image: 'http://card-1254165941.cosgz.myqcloud.com/cardBg/%E7%BE%8A.jpg',
    title: '羊',
  },
  {
    id: 12,
    image: 'http://card-1254165941.cosgz.myqcloud.com/cardBg/%E7%8C%B4%E5%AD%90.jpg',
    title: '猴',
  },
  {
    id: 13,
    image: 'http://card-1254165941.cosgz.myqcloud.com/cardBg/%E9%B8%A1.jpg',
    title: '鸡',
  },
  {
    id: 14,
    image: 'http://card-1254165941.cosgz.myqcloud.com/cardBg/%E7%8B%97.jpg',
    title: '狗',
  },
  {
    id: 15,
    image: 'http://card-1254165941.cosgz.myqcloud.com/cardBg/%E7%8C%AA.jpg',
    title: '猪',
  },
]
